void main() {
  //null safety
  //  الفكره ان في لغه درت  لازم المتغير باخد قيمه مش يفضل فاضي
  // فاعشان نحل المشكله دي عملنا ان احنا نحط علامه استفهام بعد الداتا تايب
  // ولازم نعمل امر اف كوندشن عشان نحل المشكله  ونتاكد ان القيمه اتغيرت بعدين
  // int x = 10;
  // int? y;
  // // y = 10; << حطتها بعدين
  // if (y != null) {
  //   int re = x * y;
  //   print(re);
  // }

  // int? x;
  // int y = 20;
  // x = 30;
  // int z = x * y;
  // print(z);

//   int? num1;
//   // int num2 = 30;
//   // num1 = 20;
//   // int x = num1 * num2;
//   // print(x);
//   int x = num1 ?? 20;
//   print(x);

//

  // int? x;

  // print(x?.toDouble());
}
